CSI API ETABS v1
cFrameObj.DeleteLateralBracing Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int DeleteLateralBracing(
	string Name,
	int MyType = 3,
	eItemType ItemType = eItemType.Objects
)
Function DeleteLateralBracing (
	Name As String,
	Optional MyType As Integer = 3,
	Optional ItemType As eItemType = eItemType.Objects
) As Integer
Dim instance As cFrameObj
Dim Name As String
Dim MyType As Integer
Dim ItemType As eItemType
Dim returnValue As Integer
returnValue = instance.DeleteLateralBracing(Name,
	MyType, ItemType)
int DeleteLateralBracing(
	String^ Name,
	int MyType = 3,
	eItemType ItemType = eItemType::Objects
)
abstract DeleteLateralBracing :
        Name : string *
        ?MyType : int *
        ?ItemType : eItemType
(* Defaults:
        let _MyType = defaultArg MyType 3
        let _ItemType = defaultArg ItemType eItemType.Objects
*)
-> int
Parameters
Name
Type: System.String
MyType (Optional)
Type: System.Int32
ItemType (Optional)
Type: ETABSv1.eItemType
Return Value
Type: Int32
See Also
Reference
cFrameObj Interface
ETABSv1 Namespace